[
  {
    "number": 1,
    "title": "Romance Dawn",
    "chapters": [1, 2, 3, 4, 5, 6, 7, 8],
    "synopsis": "Seven-year-old Monkey D. Luffy tries to join 'Red-Haired' Shanks' pirate crew, but is rejected as too young. He accidentally eats a devil fruit which causes his body to gain the properties of rubber, but makes him unable to swim. After an ordeal with mountain bandits, Luffy abandons his plan to join Shanks' crew; instead, he vows to surpass Shanks, build up a crew of his own and become the next king of the pirates. Ten years later Luffy sets out to sea, frees the young Coby from a slave's life in Alvida's pirate crew and saves three-sword-wielding bounty hunter Roronoa Zoro from being executed by the Navy. With Zoro Luffy's first crewman, they set sail for the Grand Line (the sea where the One Piece – the treasure of the last king of the pirates – is supposedly hidden), and meet thief (and expert navigator) Nami."
  },
  {
    "number": 2,
    "title": "Buggy the Clown",
    "chapters": [9, 10, 11, 12, 13, 14, 15, 16, 17],
    "synopsis": "Luffy begs Nami to become a pirate and his crew's navigator, but she refuses and uses him as bait to steal the treasure of pirate captain Buggy the Clown. As Luffy and Zoro fight the Buggy Pirates, Buggy is found to have the power of a devil fruit which allows him to separate his body parts at will. With Buggy's crewmen defeated, Luffy fights him one-on-one."
  },
  {
    "number": 3,
    "title": "Don't Get Fooled Again",
    "chapters": [18, 19, 20, 21, 22, 23, 24, 25, 26],
    "synopsis": "Luffy and Buggy fight in a bizarre show of devil-fruit powers until Nami joins the fight and Buggy is defeated by the two (temporary) allies. Leaving with some of Buggy's treasure, they and Zoro set sail for the hometown of chronic liar Usopp. In search of a large ship, Luffy and his crew visit the mansion of the sickly young Kaya; they are turned away by her overprotective butler, Klahador. Usopp and Luffy later overhear Klahador (who is really the notorious pirate Kuro) and his first mate, Django, plan to kill Kaya so Kuro can inherit her wealth and social status."
  },
  {
    "number": 4,
    "title": "The Black Cat Pirates",
    "chapters": [27, 28, 29, 30, 31, 32, 33, 34, 35],
    "synopsis": "Usopp fails to convince the villagers of the impending pirate invasion, but when he decides to prevent the raiding party from reaching them he is joined by the Straw Hat Pirates. They spend the night in preparation, planning to stop the Black Cat Pirates on the coast. However, they pick the wrong side of the village to protect; when they realize their mistake, they have to hurry to reach the other coast. The fight goes well, although they are unprepared and greatly outnumbered. Kuro, angered by the raiding party's delay, appears on the battlefield; so does Kaya, in a futile attempt to negotiate a compromise."
  },
  {
    "number": 5,
    "title": "For Whom the Bell Tolls",
    "chapters": [36, 37, 38, 39, 40, 41, 42, 43, 44],
    "synopsis": "Django, ordered to kill Kaya after forcing her to write a will favoring Kuro, chases her through the forest; Zoro and Usopp are chasing them. On the shore, Luffy and Kuro fight one-on-one and the Straw Hats prevail. With Usopp the newest addition to the crew and a ship named Going Merry as a parting gift from Kaya, they leave the island. At sea they meet Zoro's former bounty-hunting partners Johnny and Yosaku, who tell them about a floating restaurant near the Grand Line where the crew might find a cook and (to Zoro's delight) 'Hawk-Eye' Mihawk – the world's best swordsman – was reportedly sighted. When they arrive, Luffy accidentally damages the restaurant and injures its head chef. In compensation, he agrees to work there for one week. When he sees assistant head chef Sanji give free food to Gin, a starving pirate, he decides to persuade the cook to join his crew."
  },
  {
    "number": 6,
    "title": "The Oath",
    "chapters": [45, 46, 47, 48, 49, 50, 51, 52, 53],
    "synopsis": "Luffy is a kitchen assistant and waiter until the torn-up flagship of Pirate Commodore Don Krieg lays anchor next to the floating restaurant and a half-starved Krieg, leaning on Gin, staggers inside. He begs for food, which Sanji provides without hesitation. When Krieg's strength is restored he reverts to his normal self, demanding ownership of the restaurant and food for his 100 men. Nami leaves with the Going Merry, and Mihawk arrives. The master swordsman followed Krieg from the Grand Line, where he had wiped out his entire fleet. Zoro challenges him to a duel and, despite his best efforts, is defeated. After the fight, Usopp, Johnny, and Yosaku take Zoro aboard the bounty hunters' boat and set sail to follow Nami. Luffy is left behind to pay his debt to the restaurant by defeating Krieg and his men."
  },
  {
    "number": 7,
    "title": "The Crap-Geezer",
    "chapters": [54, 55, 56, 57, 58, 59, 60, 61, 62],
    "synopsis": "Luffy and the cooks defend the restaurant until Gin takes the one-legged head chef Zeff hostage, hoping to resolve the situation without Sanji's death. Fearing for Zeff's life, Sanji stops fighting but does not surrender the ship to the pirates. In a flashback, a young Sanji and Zeff (a renowned pirate) are shipwrecked. Zeff gives Sanji a small bundle of food and sends him to the other side of the island to keep watch, while Zeff keeps a much larger bundle for himself. Weeks later, a famished Sanji returns to take the pirate's food only to discover that the bundle contains nothing but gold and that Zeff has devoured his own leg. In the present, Gin realizes that he cannot save Sanji's life because he is hell-bent on protecting Zeff's restaurant. Instead, Gin decides to kill Sanji with his own hands. When the time comes, he cannot do it and begs Krieg to leave the restaurant alone. Outraged at Gin's disobedience, Krieg uses poison gas against his right-hand man."
  },
  {
    "number": 8,
    "title": "I Won't Die",
    "chapters": [63, 64, 65, 66, 67, 68, 69, 70, 71],
    "synopsis": "While the cooks (ordered by Sanji) tend to the poisoned Gin, Luffy charges at Krieg. Although the commodore uses his many weapons to severely injure him, Luffy wins; with his debt repaid, he is free to go. However, Sanji still refuses to join Luffy's crew. Only after an attempt by the cooks to convince him he is unwanted does he finally agree. Nami is welcomed back to Arlong Park, the base of Arlong's pirates (a crew consisting, aside from Nami, only of fish-men – beings who are half fish and half human. Zoro and Usopp learn separately that Nami is one of Arlong's officers – Usopp from Nami's adoptive sister Nojiko, and Zoro from Nami when he is captured and dragged into Arlong Park."
  },
  {
    "number": 9,
    "title": "Tears",
    "chapters": [72, 73, 74, 75, 76, 77, 78, 79, 80, 81],
    "synopsis": "To save the life of the villager Genzo, Usopp angers Arlong by shooting at him. Zoro (freed by Nami and told to run away while he still can) defeats Arlong's low-ranking crews at Arlong Park and meets gullible octopus fish-man Hatchan, who brings him to Nami's hometown. Usopp is captured and brought to Arlong Park, where Nami is accused of hiring Zoro to kill Arlong. To increase the crew's mistrust and save Usopp's life, she apparently kills him and kicks his body into the sea. Luffy and Sanji arrive; although they want to help, Nami turns them away. In a flashback, Arlong's crew arrives and extorts protection money from the island's inhabitants. Nami and Nojiko's foster mother, Bellemere, who cannot pay for all three of them, gives up her life to save her daughters. Nami joins Arlong's crew as their cartographer, and they agree on a price for which she can buy her village back. In the present Arlong breaks the agreement, and Nami accepts Luffy's help."
  },
  {
    "number": 10,
    "title": "OK, Let's Stand Up!",
    "chapters": [81, 82, 83, 84, 85, 86, 87, 88, 89, 90],
    "synopsis": "The Straw Hats charge into Arlong Park. Luffy takes out the fish-men's pet sea monster and most of the crew, but his feet become stuck in the ground. Arlong uses the opportunity to dig out the ground containing Luffy's feet and throw it into the sea. Zoro, struggling with a severe injury received from Mihawk and armed with only one sword, fights the six-sword-wielding Hatchan and Sanji uses karate on the fish-men with swordfish-man Kuroobi. Genzo and Nojiko try to save Luffy from drowning, and further inland Usopp duels with the long-mouthed fish-man Choo. All of Arlong's crew are defeated except for Arlong himself. With Zoro's last bit of strength, he buys Sanji enough time to dive under and remove the rock from his captain's feet. When he is free, Luffy takes Zoro's place and his final fight with Arlong begins."
  },
  {
    "number": 11,
    "title": "The Meanest Man in the East",
    "chapters": [91,92,93,94,95,96,97,98,99],
    "synopsis": "Arlong and Luffy exchange blows until Arlong impatiently picks up his large sword. Tearing through Arlong Park, he chases Luffy into the cartography room where Nami spent years drawing maps for the fish-men. When he sees blood stains on her pen, Luffy decides that he must destroy the room. He breaks the blade of Arlong's sword, and crushes the fish-man and his park into the ground. Overjoyed at their regained freedom, the island's inhabitants celebrate for three days and nights. Johnny and Yosaku take their leave and with Nami on board and the Straw Hat Pirates set sail for the next port – Lougetown, where Gold Roger (the king of the pirates) was born and executed. News of Luffy's victory over Arlong and the first bounty placed on his head by the World Government reaches the ears of Navy captain Smoker; Zoro meets sergeant-major Tashigi (Smoker's second-in-command) and Luffy visits the execution site, seeing his former opponents Buggy and Alvida."}
  {
    "number": 12,
    "title": "The Legend Begins",
    "chapters": [100,101,102,103,104,105,106,107,108],
    "synopsis": "As the Straw Hats try to flee the island, Smoker gets in their way. Luffy fights him, but is quickly pinned to the ground. With the help of a man named Dragon, he escapes. The Straw Hats enter the Grand Line by crossing Reverse Mountain, where they are swallowed by the giant whale Laboon. In its stomach they meet Mr. 9 and Miss Wednesday (who try to kill the whale to feed their village) and Crocus, Laboon's caretaker. Crocus shows them the way out, telling the whale's story, and introduces the Straw Hats to navigating the Grand Line. Luffy impulsively gives Miss Wednesday and Mr. 9 a ride to Whiskey Peak, their home village. Their arrival is celebrated by the townspeople, who are bounty hunters for Baroque Works. With his comrades fast asleep after the party, Zoro must fight the roughly 100 bounty hunters himself."}
  {
    "number": 13,
    "title": "It's All Right!!!",
    "chapters": [109,110,111,112,113,114,115,116,117],
    "synopsis": "Zoro fights the four remaining bounty hunters as a far-greater threat enters the village: the high-ranking Baroque Works agents Mr. 5 and Miss Valentine. Their target is not the Straw Hats but Miss Wednesday, whose true identity is Nefeltari Vivi (princess of the kingdom of Alabasta). Vivi runs for her life; Nami (who had feigned sleep) makes a deal to save Vivi's life with Mr. 8 – who is actually Igaram, captain of the Alabastan Royal Guard. Nami then forces Zoro to take on the agents. Out of immediate danger, Vivi tells the Straw Hats that Mr. 0 (in charge of Baroque Works) plans to use the organization to overthrow her country and reveals his true identity: Sir Crocodile – like Mihawk, a member of the government-sanctioned Seven Warlords of the Sea pirate group. The Straw Hats agree to bring Vivi to Alabasta. They reach the jungle-covered island of Little Garden, where the giants Dorry and Broggy engage in a hundred-year-long battle."}
  {
    "number": 14,
    "title": "Instinct",
    "chapters": [118,119,120,121,122,123,124,125,126],
    "synopsis": "Baroque Works agents Mr. 3 and Miss Golden Week are on the island in search of the Straw Hats and the bounties on the giants' heads. With the help of Mr. 5 and Miss Valentine, they rig the giants' fight. After thousands of draws, Broggy strikes Dorry down and, while weeping over his friend's body, is captivated by Mr. 3's wax-creation powers. Zoro, Nami and Vivi are captured and placed on a large candle with a rotating top, designed by Mr. 3 to slowly turn them into wax figures by covering them in vaporized wax. Luffy, Usopp and Vivi's ostrich-sized duck, Karoo, come to save them. Mr. 5 and Miss Valentine chase Usopp and Karoo, while Luffy fights Mr. 3 and sends him flying into the jungle. However, Luffy is no match for Miss Golden Week and her hypnotic paintings. Joining forces, though, Luffy, Usopp and Karoo destroy the wax structure and free their friends."}
  {
    "number": 15,
    "title": "Straight Ahead!!!",
    "chapters": [127,128,129,130,131,132,133,134,135,136],
    "synopsis": "Sanji, drinking tea in Mr. 3's hideout, receives a call from Mr. 0. Pretending to be the agent, he convinces the warlord that he killed Vivi and her companions. Messengers arrive during the conversation; Sanji defeats them and takes their eternal pose compass, intended for Mr. 3. Although Broggy is still grieving his fellow giant's apparent death, after a century of battle his axe had become dull and Dorry is only unconscious. Using the eternal pose, the crew can continue their journey. However, Nami falls ill and the crew must find a doctor. After a hostile encounter with the pirates of the omnivorous Wapol, they arrive at a snow-covered island. The only physician there, who lives in a castle on a mountain, is said to be a 140-year-old witch. Sanji and Luffy, carrying Nami on his back, face the island's dangerous wildlife and bring their friend to medical care and Wapol reinstates himself as king of the country."}
  {
    "number": 16,
    "title": "Carrying on His Will",
    "chapters": [137,138,139,140,141,142,143,144,145],
    "synopsis": "Luffy carries Nami, and later Sanji as well, uphill and over a steep stone wall to bring them to Doctor Kureha. Everyone recovers quickly under her care and that of her blue-nosed pet reindeer, Chopper, who can think, speak and assume human appearance since eating a devil fruit. Kureha tells Nami about Chopper's difficult past, and Luffy decides to take him with them. Wapol arrives at the castle, intent on reclaiming his former home. In a flashback, Chopper meets the quack doctor Hiruluk and spends a year in his care. When Hiruluk is dying of an illness, he chases Chopper away to spare him the sight. Chopper, learning about Hiruluk's reason for chasing him, goes on a dangerous journey to find a poisonous mushroom to cure him. Impressed with the reindeer's compassion, before he dies Hiruluk arranges for Kureha to teach Chopper medicine."}
  {
    "number": 17,
    "title": "Hiruluk's Cherry Blossoms",
    "chapters": [146,147,148,149,150,151,152,153,154,155],
    "synopsis": "Luffy, Sanji and Chopper fight Wapol and his henchmen, Chess and Kuromarimo. Wapol uses his devil-fruit power to become a cannon-armed house and fuses his men into the two-headed, four-armed Chessmarimo. Sanji's back aches, keeping him from fighting. Chopper takes a drug he calls Rumble Ball, and defeats Chessmarimo. Wapol sneaks into the castle and chases Nami. Luffy catches up to them as Wapol attempts to open the weapon storage. Unable to do so because Nami has taken his key, Wapol retreats to his cannon at the top of the castle. The cannon does not work, and Luffy sends him flying off the island. Luffy tries to persuade Chopper to join the crew, and the reindeer finally agrees. With a doctor aboard, the crew continues its journey to Alabasta."}
  {
    "number": 18,
    "title": "Ace Arrives",
    "chapters": [156,157,158,159,160,161,162,163,164,165,166],
    "synopsis": "En route to Alabasta, the Straw Hats encounter Baroque Works agent Mr. 2 Bon Clay; naively, he shows them his ability to impersonate the voice, face and body of any person whose face he touches with his right hand. In Alabasta, Luffy goes to find something to eat. He encounters his older brother Portgas D. Ace and Captain Smoker, who chases him through the town. With Ace's help, Luffy escapes. The top Baroque Works agents meet at a cafe in the desert. From there they are brought to a city, Rainbase, to meet Mr. 0. The Straw Hats cross the desert to the oasis of Yuba, where the rebel army reportedly has its headquarters. They find a ghost town, plagued by sandstorms. Vivi tells a story about herself and her childhood friend, Koza. In Rainbase, Crocodile reveals himself and his master plan to conquer Alabasta to his agents. When Mr. 3 reports his failure to kill Vivi and the Straw Hats, Crocodile feeds him to one of his oversized crocodiles. Although Luffy is discouraged, Vivi's passion for the cause inspires him to persevere."
  }
  {
    "number": 19,
    "title": "Rebellion",
    "chapters": [167,168,169,170,171,172,173,174,175,176],
    "synopsis": "Karoo brings news of Crocodile's treachery to the king, who decides to attack Rainbase and sends Pell (the country's strongest soldier) to scout ahead. Smoker awaits the Straw Hats in Rainbase and chases several of them into Crocodile's casino, where they fall through a trapdoor into a cage. After defeating Pell, Crocodile's partner Miss All-Sunday captures Vivi and brings her to the casino; Baroque Works' final plan is set in motion. The king is abducted, and the rebellion supplied with weapons. Mr. 2, impersonating the king, admits stealing the country's rain. In response, the rebels attack the capital. Crocodile leaves the cage surrounded by his oversized crocodiles, while the room floods with water. Chopper lures Crocodile away from the casino, while Sanji enters it and fights the crocodiles. One of them spits out Mr. 3, and Sanji forces him to open the cage by creating a key. Smoker, aware of Crocodile's plan, calls for reinforcements while the Straw Hats head for Alubarna. Luffy, however, stays behind to take on the warlord."}
  {
    "number": 20,
    "title": "Showdown at Alubarna",
    "chapters": [177,178,179,180,181,182,183,184,185,186],
    "synopsis": "Luffy fights Crocodile; despite many hits, his opponent is unfazed. Crocodile, using his devil-fruit ability to dissolve and reintegrate whatever part of his body Luffy attacks, toys with him until he impales him through the chest with his prosthetic hook and buries him in the sand. The rest of the Straw Hats hurry to intercept the rebel army. They cross the desert on a giant crab, cross the river Sandora and are picked up on the other side by Karoo and his squad of spot-billed ducks. In front of the capital, the high-ranking Baroque Works agents try to intercept Vivi and are lured into the city by disguised Straw Hats. Vivi tries to stop the rebels, but the enraged army storms past her. She flees from Mr. 2, who chases her into the city (where Sanji comes to her rescue). On the other side of the city, Usopp and Chopper battle the agents Mr. 4 and Miss Merry Christmas."
  },
  {
    "number": 21,
    "title": "Utopia",
    "chapters": [187,188,189,190,191,192,193,194,195],
    "synopsis": "Sanji and Mr. 2 Bon Clay exchange blows, until Bon Clay discovers the sea cook's weakness and he transforms to resemble Nami to distract him. Bon Clay dominates the fight, but Sanji is able to defeat him after exploiting Bon Clay's vulnerability when he transforms. Nami fights Miss Doublefinger, partner of Mr. 1, and a Devil Fruit user who can create spikes anywhere on her body, during which she struggles with how to use her new Climate Baton weapon. Unfortunately, most of that weapon's abilities are nothing more than magic tricks. One street further, Zoro battles Mr. 1, who possesses the ability to create blades anywhere on his body. Meanwhile, Vivi reaches Chaka, the acting captain of the royal guard, but before they can stop the fighting, Crocodile and 'Ms. All-Sunday' Nico Robin arrive."
  },
  {
    "number": 22,
    "title": "Hope",
    "chapters": [196,197,198,199,200,201,202,203,204,205],
    "synopsis": "Despite his agents' defeats, Crocodile is still confident that his plans to take over the kingdom are nearing fruition. With Alabasta embroiled in a civil war of his own design, Crocodile needs only to destroy both warring parties in one fell swoop to take control of the country. Knowing that a cannon is the most practical way of fulfilling this purpose, Nefertari Vivi and the Straw Hat Pirates try to find its hiding place before it is too late. Meanwhile, Crocodile searches for Pluton, forcing King Cobra to lead him and Nico Robin to an ancient stone called a Ponegliff underneath the castle. But when Nico Robin says the Ponegliff has no information on the Plulton, Crocodile tries to kill her and escape before his cannon is fired. Monkey D. Luffy, having recovered and learned from their previous encounter, engages Crocodile in battle."
  },
  {
    "number": 23,
    "title": "Vivi's Adventure",
    "chapters": [206,207,208,209,210,211,212,213,214,215,216],
    "synopsis": "The cannon is hidden in the clock tower overlooking the capital city, and the Straw Hat Pirates frantically try to reach it before it is fired. In the final moments the cannon is stopped, Luffy finally defeats Crocodile, and uses the last of his energy to save King Cobra and Nico Robin. Most importantly, it begins to rain, ending the civil war and the drought that caused it. Crocodile and his agents are arrested, and the Straw Hats collapse. Alabasta tends to their wounds and celebrates them as heroes. But as pirates, they are criminals, and are forced to flee the country in secret to avoid arrest. Bon Clay distracts the Marines to allow the Straw Hats to say farewell to Vivi, and they set sail for their next adventure."
  },
  {
    "number": 24,
    "title": "People's Dreams",
    "chapters": [217,218,219,220,221,222,223,224,225,226],
    "synopsis": "Indebted to Luffy for rescuing her, Nico Robin joins the Straw Hat Pirates. An old ship falls from the sky. Rummaging through some of its remains, while dealing with a rival salvaging crew led by the monkey-like Masira, and nearby monstrous sea creatures, the Straw Hats discover the fallen ship has come from an island high in the sky. Unsure of how to reach it, the Straw Hats visit a nearby port on the island of Jaya. There they meet Bellamy, a pirate who looks down on Luffy, and mocks his dreams of becoming Pirate King. Luffy, who had promised Nami not to fight in the town, allows himself to be beaten up and bullied by Bellamy. The Straw Hats then proceed to another part of Jaya to meet a man who might have a lead on how to reach the sky island. However, they must first get past Masira's brother Shoujou and his crew."
  },
  {
    "number": 25,
    "title": "The 100 Million Berry Man",
    "chapters": [227,228,229,230,231,232,233,234,235,236],
    "synopsis": "The Straw Hats meet with Mont Blanc Cricket, a descendant of "Liar" Noland, famous for lying about a city of gold. But Cricket searches for evidence that can confirm that city's existence. Over the years he has come to believe that city, once a part of Jaya, was submerged at the bottom of the sea. If the Straw Hats want to reach the sky island they will need to ride that same current, but must first locate a special bird that will help them find their way. While Luffy and company go searching for the bird, Bellamy attacks and robs Cricket in an attempt to crush his dreams of finding the island in the sky. Enraged to learn this, after returning with the bird, Luffy seeks out and defeats Bellamy to recover Cricket's belongings. Cricket thanks him, and the Straw Hats leave to ride the current to Skypiea."
  },
  {
    "number": 26,
    "title": "Adventure on Kami's Island",
    "chapters": [237,238,239,240,241,242,243,244,245,246],
    "synopsis": "The Straw Hats successfully reach the cloud harboring a cloud sea, and soon after their arrival meet some of its inhabitants: a hostile group of apparently primitive natives, and a friendlier people of the more civilized town of Angel Island. While the rest of Straw Hats mingle with them, learning of the town's history, and enjoying its unique technology, the ship's navigator Nami explores the endless sea of clouds. She finds Skypiea, but learns that the Straw Hats have been labeled as trespassers and will be dealt with accordingly. Although able to fend off an initial arrest attempt, their ship, and some of the crew, is taken away by Eneru, the current god of all that lies atop the cloud. Free, but wishing to reunite with their friends, Luffy, Sanji, and Usopp enter Skypiea, Eneru's domain."
  },
  {
    "number": 27,
    "title": "Overture",
    "chapters": [247,248,249,250,251,252,253,254,255],
    "synopsis": "Upon entering Skypiea they incite the wrath of Eneru's four priests. As Luffy and company deal with one of the four, the "captured" crew is forced to fight a second of Eneru's priests. They are saved by his predecessor, Ganfor, who is only able to make the priest leave after being defeated. Elsewhere, Luffy is able to defeat the first priest, and soon afterward reunites with his crew. After Ganfor is healed, he tells them of a city of gold hidden somewhere in Skypiea. To make themselves rich, the Straw Hats go looking for the gold, only to find themselves in the middle of a war between Eneru and the Shandians, the natives of Skypiea."
  },
  {
    "number": 28,
    "title": "Wyper the Berserker",
    "chapters": [256,257,258,259,260,261,262,263,264],
    "synopsis": "With the war's start, Eneru decides to make a bet: of the eighty-one combatants currently on Skypiea (the Straw Hats, the Shandians, and his own forces), only five will remain in three hours' time. The Shandians engage Eneru's forces, the remaining priests fight the Shandians, and the Straw Hats fight whoever is left. After two hours, the number of active combatants dwindles to twenty-five. Luffy mistakes a giant snake's mouth for a cave."
  },
  {
    "number": 29,
    "title": "Oratorio",
    "chapters": [265,266,267,268,269,270,271,272,273,274,275],
    "synopsis": "Having had a specific goal for becoming god, and with that goal now in sight, Eneru starts picking off the remaining combatants to complete his plans and ensure his prediction will be accurate. Those who remain (plus Luffy's snake-captor) are drawn into one big, final brawl. Meanwhile, Nico Robin locates the city of gold, only to find that all the gold is gone. The pieces begin to fall into place, and it is discovered that Eneru plans to destroy everyone who resides in the sky, while escaping to the seas below on his ship made of gold. With the five surviving "contestants" unaware of this, they engage Eneru (the sixth) in battle to see who will be excluded from his prediction. With his mastery over thunder, Eneru reduces the playing field to the promised five, but then decides that none of them is worthy of escaping with him to the blue seas."
  },
  {
    "number": 30,
    "title": "Capriccio",
    "chapters": [276,277,278,279,280,281,282,283,284,285],
    "synopsis": "To save her own skin, Nami convinces Eneru to take her with him. They leave for the golden ship, leaving the defeated combatants to their fate. After Luffy escapes from the giant snake, and learns what Eneru has done to his crew, he goes to meet Skypiea's god in battle. Although initially confident that he can beat Luffy, Eneru soon finds that he is no match for the Straw Hat captain: Luffy's rubber body makes him immune to all of Eneru's lighting attacks. Rather than fight, Eneru traps Luffy in a prison of gold and throws him overboard, expecting the gold's weight to keep him away. Eneru sets sail and prepares to destroy the island in the sky. He is briefly impeded in his efforts by the remaining Straw Hats, Usopp and Sanji, giving the inhabitants of Angel Island, who have learned of Eneru's plans, time to evacuate."
  },
  {
    "number": 31,
    "title": "We'll Be Here",
    "chapters": [286,287,288,289,290,291,292,293,294,295],
    "synopsis": "In a flashback, Montblanc Noland, Cricket's ancestor, arrives on Jaya. He finds the early Shandians, who are being plagued by a terrible disease. After curing them a friendship is formed, and although Noland is forced to return to his homeland, the Shandians promise to help them meet again by ringing a special golden bell. Soon afterwards the part of Jaya, later known as Skypiea, is launched into the sky, and the inhabitants of Angel Island expels the Shandians from Skypiea. In the present, the Shandians continue to fight to reclaim the bell that will reunite them with Noland, not knowing he has long since been executed for "lying" about the location of the city of gold. Wishing to ring the bell to let Cricket know that the city of gold exists, Luffy unites all the people of the sky against Eneru."
  },
  {
    "number": 32,
    "title": "Love Song",
    "chapters": [296,297,298,299,300,301,302,303,304,305],
    "synopsis": "With the destruction of the sea of clouds almost complete, Luffy is finally able to reach and defeat Eneru, saving Skypiea and all its inhabitants. As Eneru falls, Luffy rings the golden bell confirming Skypiea's existence for Cricket, and ending the Shandians' reasons for fighting with Angel Island. The two sides live together on Skypiea, Ganfor reclaims his position as god, and Eneru escapes the clouds to explore the earth outside. The Straw Hats, having become saviors again, secretly flee once more. This time they take pillaged treasures, unaware that the Shandians wish to offer them much more, and return to the blue seas. They eventually arrive on an island where they meet Foxy, who challenges them to a competition among pirates."
  },
  {
    "number": 33,
    "title": "Davy Back Fight",
    "chapters": [306,307,308,309,310,311,312,313,314,315,316],
    "synopsis": "The rules of the competition are simple: Foxy's crew and the Straw Hats will face each other in three rounds. Whoever wins a round gets to have someone from the opposing team join their crew, or take the other team's pirate flag. Foxy wins Tony Tony Chopper in a race around the island, but the Straw Hats win Chopper back in a game of dodge ball. Luffy and Foxy face each other in the final round of boxing, which evolves into a battle between Luffy's rubber abilities and Foxy's time-stopping power."
  },
  {
    "number": 34,
    "title": "The City of Water, Water Seven",
    "chapters": [317,318,319,320,321,322,323,324,325,326,327],
    "synopsis": "Luffy wins! Uninterested in any member of Foxy's crew, but not wishing to take their honor, Luffy replaces Foxy's flag with a new (and poorly drawn) one. Foxy sets sail swearing revenge, and the Marine admiral Aokiji introduces himself to the Straw Hats. Recognizing the threat they might pose to the Marines, before leaving, Aokiji encases Robin, with whom he has some history, and Luffy in ice. After they recover, the Straw Hats continue to the city of Water Seven in search of someone who can repair their ship, the Going Merry. They explore the city, have the loot they took from Skypiea appraised, and have Galley-La, a team of shipwrights, look at their ship. Though willing to pay any price to repair the Merry, the damage it sustained during their adventures is too great to be fixed."
  },
  {
    "number": 35,
    "title": "Captain",
    "chapters": [328,329,330,331,332,333,334,335,336],
    "synopsis": "Luffy reluctantly decides to abandon the ship. Usopp, having grown attached to the Merry, is unwilling to take this course of action and challenges Luffy's captaincy. Once defeated, Usopp decides to leave the Straw Hats, and the others go searching for a new ship. Meanwhile, the Aqua Laguna, an annual storm that strikes Water Seven, is about to return. To coincide with this Iceburg, the owner of Galley-La, is attacked, and Nico Robin is labeled as the prime suspect. Knowing Robin is a member of the Straw Hats, all of Water Seven turns against them."
  },
  {
    "number": 36,
    "title": "The Ninth Justice",
    "chapters": [337,338,339,340,341,342,343,344,345,346],
    "synopsis": "The Straw Hats are on the run and Robin is nowhere to be found. In order to determine where her allegiances lie, the Straw Hats decide to break into Galley-La's headquarters to find her. To their surprise, they are not the only ones laying siege to Galley-La; a masked group has already infiltrated the headquarters looking for the blueprints to the ancient weapon Pluton. After finding the blueprints and discovering that they are fake, the masked individuals approach the recovering Iceburg. They remove their disguises, revealing themselves as Robin and some of the workers of Galley-La. Members of the secret government organization, Cipher Pol #9, they joined Galley-La to gain Pluton for the government's use. After speaking with Iceberg, they learn that the real blueprints are with Franky, a shipwright and friend of Iceberg."
  },
  {
    "number": 37,
    "title": "Tom",
    "chapters": [347,348,349,350,351,352,353,354,355,356,357],
    "synopsis": "The Straw Hats arrive on the scene and find Robin with CP9. Although she claims to want nothing more to do with them, Luffy and company attack CP9 so that they can talk to her. They are quickly defeated, and CP9 departs to look for Franky. As the Aqua Laguna approaches, Franky has given Usopp and the Merry shelter. Soon enough CP9 arrives looking for Franky and his blueprints. Because his teacher, entrusted him with the blueprints years earlier, and forfeited his own life to insure Pluton never fell into the government's hands, Franky refuses to reveal their location."
  },
  {
    "number": 38,
    "title": "Rocketman!!",
    "chapters": [358,359,360,361,362,363,364,365,366,367],
    "synopsis": "After the Straw Hats recover from their injuries they discover that Robin has sided with the government in order to save the rest of the crew from destruction. CP9 captures Franky and Usopp and takes them and Robin to Enies Lobby, the government's judiciary island, using a sea train. Sanji sneaks on board in an effort to save them, freeing Usopp and Franky before continuing on to Robin. The rest of the Straw Hats, the loyal members of Galleyla, and Franky's friends, follow on a sea train of their own, unimpeded by the Aqua Laguna."
  },
  {
    "number": 39,
    "title": "Scramble",
    "chapters": [368,369,370,371,372,373,374,375,376,377,378],
    "synopsis": "As they move through the train looking for Robin, Sanji, Usopp, and Franky deal with the lesser members of Cipher Pol. Although they find her, Robin does not allow herself to be saved. CP9 captures Franky again, kicks Sanji and Usopp from the train, and continues on to Enies Lobby. Sanji and Usopp wait along the tracks, and reunite with Luffy and the others when they go by. They arrive at the judiciary island soon after CP9 does and engage the forces of the world government in order to get Robin back."
  },
  {
    "number": 40,
    "title": "Gear",
    "chapters": [378,379,380,381,382,383,384,385,386,387,388],
    "synopsis": "The Straw Hats lay waste to Enies Lobby, defeating anyone who tries to keep them from Robin. As the rest of the crew deals with the less formidable guardians of the island, Luffy goes ahead and calls out to CP9. Only one member of CP9, Blueno, agrees to fight him, remembering how quickly Luffy was defeated in their last encounter. As the battle progresses Luffy demonstrates his ability to use one of CP9's abilities. After using his "Gear Two" and before demonstrating his "Gear Three", Luffy defeats Blueno and calls out to Robin that he is there to rescue her."
  },
  {
    "number": 41,
    "title": "Declaration of War",
    "chapters": [389,390,391,392,393,394,395,396,397,398,399],
    "synopsis": "The Straw Hats and CP9, and their two captives, face each other down. Nico Robin tries turning the crew away again, but when Monkey D. Luffy tells her that she can die as part of the crew instead, Robin experiences a flashback to her childhood. Raised on an island of archaeologists, Robin and the rest of the islanders attempt to discover the secret of the void century, a period in time that the government forbids anyone to know. To prevent knowledge of the void century from spreading, the island and its inhabitants (except Robin) are destroyed. Aokiji allows Robin to escape, challenging her to find friends and to live. Realizing that she had almost given up on both, Robin decides she wants to live with the rest of the Straw Hats. Touched by their words, Franky reveals that the blueprints CP9 have been searching are hidden on his person, but they are not that of Pluton, but an "opposing weapon" and he promptly destroys them, giving CP9 no further reason to keep him in custody."
  },
  {
    "number": 42,
    "title": "Pirates vs. CP9",
    "chapters": [400,401,402,403,404,405,406,407,408,409],
    "synopsis": "The Straw Hats and Franky break off and engage CP9 in battle. Unsuited for the initial pairings, the crew exchanges opponents to improve their chances of victory, allowing two members of CP9 to be defeated. Meanwhile, Luffy follows Robin's captors, CP9 leader Spandam and CP9's strongest member Rob Lucci. Lucci fights Luffy in order to give Spandam time to take Robin to the government's inescapable prisons. Instead, while trying to call for help, Spandam accidentally triggers the destruction of the Straw Hats, summoning the world government to destroy Enies Lobby and whoever is on it."
  },
  {
    "number": 43,
    "title": "Legend of a Hero",
    "chapters": [410,411,412,413,414,415,416,417,418,419],
    "synopsis": "With the destruction of Enies Lobby imminent, all government personnel begin to evacuate. The Straw Hats continue fighting and, with the exception of Luffy versus Lucci, defeat the remaining members of CP9. Their battles won, they team up and hurry to stop Robin from being taken past the point of no return. They succeed and Robin is freed."
  },
  {
    "number": 44,
    "title": "Let's Go Back",
    "chapters": [420,421,422,423,424,425,426,427,428,429,430],
    "synopsis": "As the battle between Luffy and Lucci rages on, the destruction of Enies Lobby commences. The members of Galley-La and the 'Franky Family' evacuate as the government employees have done, and the Straw Hats secure an escape route to use after Lucci's defeat. Once Luffy wins however, Enies Lobby's destroyers unite in their efforts to finish off the crew that beat CP9. Just when they lose their last piece of refuge, the Straw Hats are able to escape on the Merry, it having come to save them in their time of need. The crew joins with Galley-La and the Frankies and returns to Water Seven. The Merry begins to break down during the trip, so with heavy hearts the crew says goodbye to the vessel and gives it a Viking funeral."
  },
  {
    "number": 45,
    "title": "You Have My Sympathies",
    "chapters": [431,432,433,434,435,436,437,438,439,440],
    "synopsis": "When they return to Water Seven, Franky decides to build a new ship for the Straw Hats. As they wait for him to finish they are visited by a contingent of naval officers led by Monkey D. Garp, Luffy's grandfather. Though on opposing sides of the law, Garp only wants to spend some time with his grandson and leaves without confrontation. Meanwhile, the Straw Hats learn that they have been blamed for the destruction of Enies Lobby and have bounties on their heads because of it. Since Franky is also subject to a bounty, he decides to join the Straw Hats after completing their ship, although they have to trick him into it by stealing his trunks. Usopp also officially rejoins the crew and they leave Water Seven. After a brief scuffle with Garp, who is forced by his superiors to try to capture Luffy, the Straw Hats continue on to their next adventure. Elsewhere, Luffy's brother, Portgas D. Ace, finds Blackbeard, the man he has spent the entirety of the series looking for. The two are drawn into a battle whose outcome is not revealed until much later."
  },
  {
    "number": 46,
    "title": "Adventure on Ghost Island",
    "chapters": [441,442,443,444,445,446,447,448,449],
    "synopsis": "The Straw Hat Pirates continue their adventure across the seas. After being stuck in a fog not even the sun can penetrate, the crew meets Brook, a living skeleton who immediately agrees to join their crew. Unfortunately for the Straw Hats, Brook lost his shadow on the giant ship known as Thriller Bark and cannot accompany them outside the fog. Determined to have Brook as part of the crew, they go to the Thriller Bark in order to get Brook's shadow back. Tony Tony Chopper, Usopp, and Nami serve as the first boarding party, and find that the ship is inhabited by zombies. When the rest of the Straw Hats follow they discover that Brook is not the only one who has lost his shadow, and that much of the island-like ship's populace have had their shadows stolen by Gecko Moria."
  },
  {
    "number": 47,
    "title": "Cloudy, Partly Bony",
    "chapters": [450,451,452,453,454,455,456,457,458,459],
    "synopsis": "Moria mobilizes his zombies to capture the Straw Hats, who in turn try to reunite their two boarding parties. However, when they begin to engage Moria's forces in an effort to accomplish this goal, members of the crew mysteriously disappear. Brook explains this is Moria's doing. He captures those who enter Thriller Bark, removes their shadows, and inserts them into patched-up corpses in order to reanimate them and create his own zombie army. The shadowless individuals are forced to stay out of the sunlight or risk their own destruction,so that most stay within the impenetrable fogs of Thriller Bark. With Sanji, Roronoa Zoro, and Monkey D. Luffy having lost their shadows and Nami similarly unaccounted for, the Straw Hats become determined to defeat Moria."
  },
  {
    "number": 48,
    "title": "Adventures of Oars",
    "chapters": [460,461,462,463,464,465,466,467,468,469,470],
    "synopsis": "Just when the Straw Hats start looking for Moria they run into Oars, the gigantic zombie who has been given Luffy's shadow. Before they deal with him, the crew splits up to get rid of the leaders of Moria's army. Sanji saves Nami from one of them, Usopp defeats another, and Nico Robin and Chopper take care of the third. Zoro, meanwhile, fights the zombie that houses Brook's shadow, and when it is defeated Brook is restored to his former self. Their immediate objectives completed, the crew turns their attention to Oars."
  },
  {
    "number": 49,
    "title": "Nightmare Luffy",
    "chapters": [471,472,473,474,475,476,477,478,479,480,481],
    "synopsis": "While Luffy chases Moria across Thriller Bark, his crew does their best to defeat Oars. Though they almost succeed, Oars is quickly joined by Moria, who gives him the advantage he needs to decimate the crew. Luffy, unaware that Moria has joined Oars, runs into a group of pirates who have lost their shadows. Seeing Luffy as their hope for freedom, they provide him with the means to bring down Moria: a hundred shadows they have managed to take back from the island's zombies. Luffy engages Oars, and with the help of his crew, they finally defeat the giant. With Thriller Bark's course having been left unattended, the fog begins to thin and the sun begins to rise. Seeing this as an effective way to get rid of the Straw Hats, Moria absorbs all the island's shadows to kill time until sunrise."
  },
  {
    "number": 50,
    "title": "",
    "chapters": [482,483,484,485,486,487,488,489,490,491],
    "synopsis": "Moria, like Luffy before him, is given the strength of all the shadows he has absorbed. Moria, however, has absorbed more shadows than he can handle, and with each successful blow Luffy lands on him he loses some of the excess shadows. When Luffy drops the whole of Thriller Bark on him, Moria loses all of his shadows, which quickly return to their original owners. No longer fearing the sun, the Straw Hats and the inhabitants of Thriller Bark begin to celebrate, only to be cut short by the arrival of Bartholomew Kuma. A Warlord of the Sea, Kuma has been sent to take Luffy's head, something nobody on Thriller Bark will allow. Kuma easily deals with all of them, but before he can kill Luffy, Zoro convinces him to spare the Straw Hat captain. Kuma leaves and they resume their celebration. With Brook free to walk in the sun, he joins the Straw Hats in leaving Thriller Bark and moving on to their next adventure."
  },
  {
    "number": 51,
    "title": "The 11 Supernovas",
    "chapters": [492,493,494,495,496,497,498,499,500,501,502],
    "synopsis": "The Straw Hats arrive at the halfway point of their adventure: the Red Line that splits the oceans in two. As pirates and thus enemies of the World Government, their only way to get through the divider is by traveling under the sea. When they meet Hatchan and his friend Camie, they learn of a man who can outfit their ship for an undersea voyage. They arrive at the archipelago where he resides and begin to search for him. While there they encounter the Celestial Dragons, the descendants of the founders of the World Government. Though angered by the Celestial Dragons' treatment of other people, Hatchan convinces the Straw Hats not to do anything, or risk the full wrath of the Government. As they continue their search, Camie is captured to be sold as a slave to the Celestial Dragons. In their attempt to rescue her Hatchan is shot by a Celestial Dragon, prompting Luffy to break his promise and punching the dragon in anger."
  },
  {
    "number": 52,
    "title": "Roger and Rayleigh",
    "chapters": [503,504,505,506,507,508,509,510,511,512],
    "synopsis": "Having assaulted a Celestial Dragon, the Straw Hats have effectively declared war against the World Government. In doing so Silvers Rayleigh, the man they have searched for, decides to reveal himself to the Straw Hats. He frees Camie, attends to Hatchan, and leaves the others to deal with the approaching navy. With the help of some fellow pirate crews the Straw Hats are able to rendezvous with Rayleigh, the former first mate of the pirate king. Optimistic that the Straw Hats will be able to emulate the pirate king's successes, he agrees to outfit their ship. While waiting for him to finish the job, the Straw Hats must elude the navy that has been sent after them, something that proves difficult to do when they keep running into copies of Bartholomew Kuma. To complicate matters, they are found by Kizaru, a navy admiral who has effortlessly dealt with all the pirates who helped the Straw Hats earlier. Just as they are about to be defeated by the combined forces, Rayleigh and the real Kuma arrive to intervene."
  },
  {
    "number": 53,
    "title": "Natural Born King",
    "chapters": [513,514,515,516,517,518,519,520,521,522],
    "synopsis": "While Rayleigh distracts Kizaru, the real Kuma confronts every member of the Straw Hats in turn. Despite their best efforts to escape, Kuma defeats each of them and causes them to disappear. Some time later, Luffy appears on an island populated only by women. Although men are forbidden to set foot on it, Luffy is able to befriend some of the islanders. When Boa Hancock, the island's leader learns of Luffy's presence, she petrifies his new friends in stone as punishment and sentences Luffy to be executed. When he shows no concern for his own fate, and asks only that his friends be freed, Hancock falls in love with him and does as he asks. Now free to roam the island, Luffy hears that his brother, Portgas D. Ace, lost his earlier battle with Blackbeard and is to be executed by the World Government. Wanting to save him, Luffy asks Hancock to take him to the government prison, Impel Down."
  },
  {
    "number": 54,
    "title": "Unstoppable",
    "chapters": [523,524,525,526,527,528,529,530,531,532],
    "synopsis": "As a pirate working for the World Government, Hancock is able to sneak Luffy into Impel Down. Luffy attempts to avoid drawing attention to himself, but meeting his old nemesis, Buggy the Clown, the entire prison is alerted to his presence. Luffy and Buggy continue through the prison's first three levels, defeating any jailers they come across. At the same time, they reunite with other pirates Luffy has met in the past, recruiting them to help find Ace. With Ace's execution only a few hours away, the chief warden, Magellan, sets out to stop Luffy himself."
  },
  {
    "number": 55,
    "title": "A Ray of Hope",
    "chapters": [533,534,535,536,537,538,539,540,541],
    "synopsis": "Luffy is found by Magellan, who uses his abilities to poison to bring Luffy to the brink of death. Luffy's old friend Bon Clay locates the inmate Emporio Ivankov to heal him, but his recovery takes several hours. When he wakes up he finds Ace has already been taken to Marine Headquarters for execution. Determined to save him, Luffy rallies the support of Iva and two of Impel Down's most dangerous prisoners: Sir Crocodile and Jimbei. Together they lead a prison break that spreads throughout Impel Down."
  },
  {
    "number": 56,
    "title": "Thank You",
    "chapters": [542,543,544,545,546,547,548,549,550,551],
    "synopsis": "The escaped prisoners make their way to Impel Down's exit, dealing with any prison guards who try to stop them. When Magellan begins to thin their numbers, Blackbeard arrives to help Luffy by holding him off. Even though he wants to take revenge on Blackbeard for Ace's capture, Luffy escapes with the other inmates. They procure a boat and set sail for Marine headquarters. Bon Clay stays behind to grant them passage. Meanwhile, with Ace's execution imminent, the reason for his death is given. He is not being executed because he is a leading member of Whitebeard's pirate crew, but because he is the son of the pirate king Gol D. Roger."
  },
  {
    "number": 57,
    "title": "Summit Battle",
    "chapters": [552,553,554,555,556,557,558,559,560,561,562],
    "synopsis": "Whitebeard, the strongest of the world's pirates, arrives with his forces to free Ace. As he and the navy begin their war to decide Ace's fate, the world watches the events of the battle unfold on television. Whitebeard's pirates are slow to gain any ground, and it is not until the arrival of Luffy and the other Impel Down escapees that they are able to break through the navy's barricade. In an effort to eliminate all of them, the navy boxes the pirates in and cuts off the telecast, wanting to keep the world from witnessing the coming slaughter."
  },
  {
    "number": 58,
    "title": "The Name of This Era is 'Whitebeard'",
    "chapters": [563,564,565,566,567,568,569,570,571,572,573],
    "synopsis": "The pirates suffer heavy casualties. Whitebeard goes on the offensive, using his ability to create earthquakes to protect his men, but he too is mortally wounded. Despite the insurmountable odds, Luffy continues trying to reach Ace. His resolve causes the pirates to rally around him, giving him enough support to finally reach and rescue his brother. Having succeeded, the pirates begin to retreat and the navy, determined not to completely lose control of the situation, focuses their efforts on stopping Luffy and Ace. The worldwide telecast is restored just as Ace is dealt a fatal blow protecting Luffy from Admiral Akainu."
  },
  {
    "number": 59,
    "title": "The Death of Portgaz D. Ace",
    "chapters": [574,575,576,577,578,579,580,581,582,583,584],
    "synopsis": "Ace dies from his injuries. Luffy is devastated by the loss and the pirates, having failed to rescue Ace, flee. Whitebeard tries to avenge Ace, but he is killed by Blackbeard and his own crew of Impel Down escapees. Blackbeard absorbs Whitebeard's ability to create earthquakes and uses it to lay waste to Marine Headquarters. When the battle turns into a battle royale between Blackbeard, the navy, and the retreating pirates, Red-Haired Shanks, Luffy's idol, intervenes and convinces all sides to stop fighting. As the world comes to grips with all that happened during the war, Hancock takes Luffy back to the island of women to recover. Luffy spends his time there reflecting on how he, Ace, and a boy named Sabo, have come to consider each other brothers despite having completely different backgrounds."
  },
  {
    "number": 60,
    "title": "My Brother",
    "chapters": [585,586,587,588,589,590,591,592,593,594],
    "synopsis": "After Sabo is assumed to have been killed by a Celestial Dragon for being "human garbage", Luffy and Ace vow to look out for each other always. With Ace now dead, Luffy believes he has nothing to live for. When he remembers that he still has his crew, Luffy makes plans to go return to the archipelago where they were last together. Rayleigh, having tracked Luffy down, advises against this; not only would they be defeated again, but the World Government is now after Luffy because of his recent actions. Rayleigh suggests an alternative approach. They go and briefly assault Marine Headquarters, something that becomes a major news story. The other Straw Hats, having been sent to different parts of the world by Kuma, quickly learn of this and find hidden meaning in Luffy's return."
  },
  {
    "number": 61,
    "title": "Romance Dawn: For the New World",
    "chapters": [595,596,597,598,599,600,601,602,603],
    "synopsis": "Before being separated, the Straw Hat Pirates had planned to meet up after three days. Captain Monkey D. Luffy's message amends that to two years. Although they wish to reunite with Luffy and comfort him about his brother, Portgas D. Ace's, death, they instead take advantage of the opportune locales that Bartholomew Kuma sent them all to improve their skills. Luffy himself trains with Silvers Rayleigh. Two years later, the Straw Hats gather on the archipelago where they were last together. A similar Marine force that caused them difficulties years ago tries to detain them, but because of their growth they easily flee. Together again, they resume their adventure by setting sail for Fishman Island, an underwater island."
  },
  {
    "number": 62,
    "title": "Adventure on Fish-Man Island",
    "chapters": [604,605,606,607,608,609,610,611,612,613,614],
    "synopsis": "As they near Fishman Island, the Straw Hats are attacked by the New Fishman Pirates, a crew of hostile fishmen, and fall overboard. Though separated again, the Straw Hats are able to make it to shore thanks to the friendlier fishmen and mermaids of the island. Luffy immediately begins to seek out the rest of his crew, while reconnecting with friends he has not seen in two years and exploring the island. When Madam Sharley, a mermaid fortuneteller, predicts that Luffy will destroy the island, the Straw Hats are invited to the royal palace. However, it is revealed to be a plot to detain them and save the island. When the Straw Hats assembled there learn of this they are forced to defeat the island's king Neptune and his royal guard and take control of the palace to avoid capture."
  },
  {
    "number": 63,
    "title": "Otohime and Tiger",
    "chapters": [615,616,617,618,619,620,621,622,623,624,625,626],
    "synopsis": "Vander Decken IX, a fishman with the power of the Mark-Mark Fruit, and Hody Jones, the leader of the New Fishman Pirates, join forces to start the complete destruction of Fishman Island. Meanwhile, Luffy befriends the island's mermaid princess Shirahoshi. Luffy and most of the Straw Hats flee and eventually regroup with Jimbei. They learn that Jimbei released Arlong into the East Blue, and also learn of the island's history. In a flashback, the Sun Pirates, a pirate group led by Fisher Tiger which includes Jimbei and Arlong, become infamous. After discovering an enslaved girl named Koala, the pirates travel to her hometown. However, Tiger dies after being attacked by the Marines on a trap and refusing a blood treatment. Jimbei replaces Tiger as the Sun Pirates' captain and Arlong - frustrated with this action - decides to go his separate ways. After becoming a Warlord by the World Government, Jimbei disbands the pirates. In her attempt to help ban discrimination against fishmen and humans, Otohime is assassinated and has her three sons and her daughter protect the queen's ideals before her death."
  },
  {
    "number": 64,
    "title": "100,000 vs. 10",
    "chapters": [627,628,629,630,631,632,633,634,635,636],
    "synopsis": "In the present, Nami forgives Jimbei for his actions and reveals that she only resents Arlong of all the fishmen. Everyone panics as Hody announces to Fishman island via Transponder Snail the coup d'etat to take over the kingdom and his intention to kill the Straw Hat Pirates for defeating Arlong. Luffy decides to go rescue the rest of his crew, but Jimbei conceives a plan. Jimbei, Shirahoshi and Megalo rush to the palace and it is revealed to Jimbei that Hody was responsible for assassinating Otohime. Using Nami's Mirage Tempo technique, the Straw Hat Pirates appear before the people of Fishman Island, and the Fishman Pirates' prisoners are freed. They then reveal that they have the Celestial Dragon's letter and Otohime's petition. In the ensuing fight with Hody, Luffy and the Straw Hats take out most of Hody's men. However, in a desperate attempt to destroy the island, Vander Decken IX uses his devil fruit powers to hurl Noah, an ancient ship, in an effort to destroy everything around it."
  },
  {
    "number": 65,
    "title": "To Zero",
    "chapters": [637,638,639,640,641,642,643,644,645,646],
    "synopsis": "As the Straw Hats fight the New Fishman Pirates' leaders, Luffy stops Shirahoshi from sacrificing herself and flies up to the Noah with her and Fukaboshi. Hody betrays Vander Decken and defeats him before challenging Luffy. As Luffy fights with Hody, Decken falls unconscious, consequently destroying the bubble. As everyone in Fishman Island is evacuating, Fukaboshi reveals to Luffy that Hody was created from the resentment against humans. Encouraged by Fukaboshi, Luffy proceeds to fight with Hody as the Ammo Knights launch a bubble to cover the Noah again, Luffy defeats Hody and attempts to destroy the ship to save the island. Meanwhile, the rest of the Straw Hats defeat Hody's officers."
  },
  {
    "number": 66,
    "title": "The Road Towards the Sun",
    "chapters": [647,648,649,650,651,652,653,654,655,656],
    "synopsis": "After Shirahoshi stops Luffy from destroying Noah, Jimbei gives his blood to a dying Luffy and tells the citizens that the law on Fishman Island is a farce. As Luffy recovers, Hody, Decken and the New Fishman Pirates are sent to jail and all charges against the Straw Hat Pirates are dropped. The Straw Hats and the island's citizens to celebrate their victory. Caribou steals the kingdom's treasure, however, but Luffy, Zoro and Sanji chase him and take it back. Luffy intercepts a call from Big Mom, one of the Four Emperors, to her henchmen and tells her that he ate the candy originally for her, and challenges Big Mom to a fight before giving the treasure to Big Mom in place of the candy to Nami's dismay. Shirahoshi makes the Straw Hats promise to see her again before the Straw Hats and the fishmen go their separate ways. Using a group of whales, Luffy and the others finally reach the New World. Over the Transponder Snail, a man asks for help before he is attacked. Reaching the burning island Punk Hazard, the Straw Hats go their separate ways to visit the island."
  },
  {
    "number": 67,
    "title": "Cool Fight",
    "chapters": [657,658,659,660,661,662,663,664,665,666,667],
    "synopsis": "While Luffy, Zoro, Robin and Usopp visit Punk Hazard, Franky, Sanji, Nami and Chopper discover a living head belonging to a samurai named Kin'emon who is searching for his son Momonosuke. The four escape into a children's room called the Biscuits Room and attempt to release the giant children imprisoned there. Brook, meanwhile, discovers the samurai's torso. A group of naval officers, led by Smoker and Tashigi, arrive at the island as Luffy and the others confront a group of creatures along the way. Meanwhile, Smoker and Tashigi are confronted by Trafalgar Law, who has become a Warlord. Law swaps the hearts of Franky, Sanji, Nami and Chopper while Luffy and the others are rescued by Brownbeard, a pirate living on the island. Luffy meets Law once again, just before the Warlord swaps Tashigi and Smoker's hearts. Luffy and the others learn about the history of Punk Hazard: once the experiment facility of Dr. Vegapunk, the government scientist involved in one of his failed experiments, sealed off the island and fled."
  },
  {
    "number": 68,
    "title": "Pirate Alliance",
    "chapters": [668,669,670,671,672,673,674,675,676,677,678],
    "synopsis": ""
  },
  {
    "number": 69,
    "title": "S.A.D.",
    "chapters": [679,680,681,682,683,684,685,686,687,688,689,690],
    "synopsis": ""
  },
  {
    "number": 70,
    "title": "Doflamingo Appears",
    "chapters": [691,692,693,694,695,696,697,698,699,700],
    "synopsis": ""
  },
  {
    "number": 71,
    "title": "Coliseum of Scoundrels",
    "chapters": [701,702,703,704,705,706,707,708,709,710,711],
    "synopsis": ""
  },
  {
    "number": 72,
    "title": "Dressrosa's Forgotten",
    "chapters": [712,713,714,715,716,717,718,719,720,721],
    "synopsis": ""
  },
  {
    "number": 73,
    "title": "Operation Dressrosa S.O.P.",
    "chapters": [722,723,724,725,726,727,728,729,730,731],
    "synopsis": ""
  },
  {
    "number": 74,
    "title": "Ever At Your Side",
    "chapters": [732,733,734,735,736,737,738,739,740,741,742],
    "synopsis": ""
  },
  {
    "number": 75,
    "title": "Repaying the Debt",
    "chapters": [743,744,745,746,747,748,749,750,751,752],
    "synopsis": ""
  },
  {
    "number": 76,
    "title": "Just Keep Going",
    "chapters": [753,754,755,756,757,758,759,760,761,762,763],
    "synopsis": ""
  },
  {
    "number": 77,
    "title": "Smile",
    "chapters": [764,765,766,767,768,769,770,771,772,773,774,775],
    "synopsis": ""
  },
  {
    "number": 78,
    "title": "Champion of Evil",
    "chapters": [776,777,778,779,780,781,782,783,784,785],
    "synopsis": ""
  },
  {
    "number": 79,
    "title": "LUCY!!",
    "chapters": [786,787,788,789,790,791,792,793,794,795],
    "synopsis": ""
  },
  {
    "number": 80,
    "title": "Opening Speech",
    "chapters": [796,797,798,799,800,801,802,803,804,805,806],
    "synopsis": ""
  },
  {
    "number": 81,
    "title": "Let's Go See the Cat Viper",
    "chapters": [807,808,809,810,811,812,813,814,815,816],
    "synopsis": ""
  },
  {
    "number": 82,
    "title": "The World Is Restless",
    "chapters": [817,818,819,820,821,822,823,824,825,826,827],
    "synopsis": ""
  },
  {
    "number": 83,
    "title": "Emperor of the Sea, Charlotte Linlin",
    "chapters": [828,829,830,831,832,833,834,835,836,837,838],
    "synopsis": ""
  },
  {
    "number": 84,
    "title": "Luffy vs. Sanji",
    "chapters": [839,840,841,842,843,844,845,846,847,848],
    "synopsis": ""
  },
  {
    "number": 85,
    "title": "Liar",
    "chapters": [849,850,851,852,853,854,855,856,857,858],
    "synopsis": ""
  },
  {
    "number": 86,
    "title": "Emperor Assassination Plan",
    "chapters": [859,860,861,862,863,864,865,866,867,868,869],
    "synopsis": ""
  },
  {
    "number": 87,
    "title": "Bittersweet",
    "chapters": [870,871,872,873,874,875,876,877,878,879],
    "synopsis": ""
  },
  {
    "number": 88,
    "title": "Lion",
    "chapters": [880,881,882,883,884,885,886,887,888,889],
    "synopsis": ""
  },
  {
    "number": 89,
    "title": "Bad End Musical",
    "chapters": [890,891,892,893,894,895,896,897,898,899,900],
    "synopsis": ""
  },
  {
    "number": 90,
    "title": "Sacred Marijoa",
    "chapters": [901,902,903,904,905,906,907,908,909,910],
    "synopsis": ""
  },
  {
    "number": 91,
    "title": "Adventure in the Land of Samurai",
    "chapters": [911,912,913,914,915,916,917,918,919,920,921],
    "synopsis": ""
  },
  {
    "number": 92,
    "title": "Introducing Komurasaki the Oiran",
    "chapters": [922,923,924,925,926,927,928,929,930,931],
    "synopsis": ""
  },
  {
    "number": 93,
    "title": "The Star of Ebisu",
    "chapters": [932,933,934,935,936,937,938,939,940,941,942],
    "synopsis": ""
  },
  {
    "number": 94,
    "title": "A Soldier's Dream",
    "chapters": [943,944,945,946,947,948,949,950,951,952,953],
    "synopsis": ""
  },
  {
    "number": 95,
    "title": "Oden's Adventure",
    "chapters": [954,955,956,957,958,959,960,961,962,963,964],
    "synopsis": ""
  },
  {
    "number": 96,
    "title": "I am Oden, and I Was Born to Boil",
    "chapters": [965,966,967,968,969,970,971,972,973,974],
    "synopsis": ""
  },
  {
    "number": 97,
    "title": "My Bible",
    "chapters": [975,976,977,978,979,980,981,982,983,984],
    "synopsis": ""
  },
  {
    "number": 98,
    "title": "Vassals of Glory",
    "chapters": [985,986,987,988,989,990,991,992,993,994],
    "synopsis": ""
  },
  {
    "number": 99,
    "title": "Straw Hat Luffy",
    "chapters": [995,996,997,998,999,1000,1001,1002,1003,1004],
    "synopsis": ""
  },
  {
    "number": 100,
    "title": "Color of the Supreme King",
    "chapters": [1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015],
    "synopsis": ""
  },
  {
    "number": 101,
    "title": "The Stars Take the Stage",
    "chapters": [1016,1017,1018,1019,1020,1021,1022,1023,1024,1025],
    "synopsis": ""
  },
  {
    "number": 102,
    "title": "The Pivotal Clash",
    "chapters": [1026,1027,1028,1029,1030,1031,1032,1033,1034,1035],
    "synopsis": ""
  },
  {
    "number": 103,
    "title": "Warrior of Liberation",
    "chapters": [1036,1037,1038,1039,1040,1041,1042,1043,1044,1045,1046],
    "synopsis": ""
  },
  {
    "number": 104,
    "title": "Shogun of Wano, Kozuki Momonosuke",
    "chapters": [1047,1048,1049,1050,1051,1052,1053,1054,1055],
    "synopsis": ""
  }
]
