[
  {
    "number": 1,
    "title": "Romance Dawn",
    "chapters": [1, 2, 3, 4, 5, 6, 7, 8],
    "synopsis": "Seven-year-old Monkey D. Luffy tries to join 'Red-Haired' Shanks' pirate crew, but is rejected as too young. He accidentally eats a devil fruit which causes his body to gain the properties of rubber, but makes him unable to swim. After an ordeal with mountain bandits, Luffy abandons his plan to join Shanks' crew; instead, he vows to surpass Shanks, build up a crew of his own and become the next king of the pirates. Ten years later Luffy sets out to sea, frees the young Coby from a slave's life in Alvida's pirate crew and saves three-sword-wielding bounty hunter Roronoa Zoro from being executed by the Navy. With Zoro Luffy's first crewman, they set sail for the Grand Line (the sea where the One Piece – the treasure of the last king of the pirates – is supposedly hidden), and meet thief (and expert navigator) Nami."
  },
  {
    "number": 2,
    "title": "Buggy the Clown",
    "chapters": [9, 10, 11, 12, 13, 14, 15, 16, 17],
    "synopsis": "Luffy begs Nami to become a pirate and his crew's navigator, but she refuses and uses him as bait to steal the treasure of pirate captain Buggy the Clown. As Luffy and Zoro fight the Buggy Pirates, Buggy is found to have the power of a devil fruit which allows him to separate his body parts at will. With Buggy's crewmen defeated, Luffy fights him one-on-one."
  },
  {
    "number": 3,
    "title": "Don't Get Fooled Again",
    "chapters": [18, 19, 20, 21, 22, 23, 24, 25, 26],
    "synopsis": "Luffy and Buggy fight in a bizarre show of devil-fruit powers until Nami joins the fight and Buggy is defeated by the two (temporary) allies. Leaving with some of Buggy's treasure, they and Zoro set sail for the hometown of chronic liar Usopp. In search of a large ship, Luffy and his crew visit the mansion of the sickly young Kaya; they are turned away by her overprotective butler, Klahador. Usopp and Luffy later overhear Klahador (who is really the notorious pirate Kuro) and his first mate, Django, plan to kill Kaya so Kuro can inherit her wealth and social status."
  },
  {
    "number": 4,
    "title": "The Black Cat Pirates",
    "chapters": [27, 28, 29, 30, 31, 32, 33, 34, 35],
    "synopsis": "Usopp fails to convince the villagers of the impending pirate invasion, but when he decides to prevent the raiding party from reaching them he is joined by the Straw Hat Pirates. They spend the night in preparation, planning to stop the Black Cat Pirates on the coast. However, they pick the wrong side of the village to protect; when they realize their mistake, they have to hurry to reach the other coast. The fight goes well, although they are unprepared and greatly outnumbered. Kuro, angered by the raiding party's delay, appears on the battlefield; so does Kaya, in a futile attempt to negotiate a compromise."
  },
  {
    "number": 5,
    "title": "For Whom the Bell Tolls",
    "chapters": [36, 37, 38, 39, 40, 41, 42, 43, 44],
    "synopsis": "Django, ordered to kill Kaya after forcing her to write a will favoring Kuro, chases her through the forest; Zoro and Usopp are chasing them. On the shore, Luffy and Kuro fight one-on-one and the Straw Hats prevail. With Usopp the newest addition to the crew and a ship named Going Merry as a parting gift from Kaya, they leave the island. At sea they meet Zoro's former bounty-hunting partners Johnny and Yosaku, who tell them about a floating restaurant near the Grand Line where the crew might find a cook and (to Zoro's delight) 'Hawk-Eye' Mihawk – the world's best swordsman – was reportedly sighted. When they arrive, Luffy accidentally damages the restaurant and injures its head chef. In compensation, he agrees to work there for one week. When he sees assistant head chef Sanji give free food to Gin, a starving pirate, he decides to persuade the cook to join his crew."
  },
  {
    "number": 6,
    "title": "The Oath",
    "chapters": [45, 46, 47, 48, 49, 50, 51, 52, 53],
    "synopsis": "Luffy is a kitchen assistant and waiter until the torn-up flagship of Pirate Commodore Don Krieg lays anchor next to the floating restaurant and a half-starved Krieg, leaning on Gin, staggers inside. He begs for food, which Sanji provides without hesitation. When Krieg's strength is restored he reverts to his normal self, demanding ownership of the restaurant and food for his 100 men. Nami leaves with the Going Merry, and Mihawk arrives. The master swordsman followed Krieg from the Grand Line, where he had wiped out his entire fleet. Zoro challenges him to a duel and, despite his best efforts, is defeated. After the fight, Usopp, Johnny, and Yosaku take Zoro aboard the bounty hunters' boat and set sail to follow Nami. Luffy is left behind to pay his debt to the restaurant by defeating Krieg and his men."
  },
  {
    "number": 7,
    "title": "The Crap-Geezer",
    "chapters": [54, 55, 56, 57, 58, 59, 60, 61, 62],
    "synopsis": "Luffy and the cooks defend the restaurant until Gin takes the one-legged head chef Zeff hostage, hoping to resolve the situation without Sanji's death. Fearing for Zeff's life, Sanji stops fighting but does not surrender the ship to the pirates. In a flashback, a young Sanji and Zeff (a renowned pirate) are shipwrecked. Zeff gives Sanji a small bundle of food and sends him to the other side of the island to keep watch, while Zeff keeps a much larger bundle for himself. Weeks later, a famished Sanji returns to take the pirate's food only to discover that the bundle contains nothing but gold and that Zeff has devoured his own leg. In the present, Gin realizes that he cannot save Sanji's life because he is hell-bent on protecting Zeff's restaurant. Instead, Gin decides to kill Sanji with his own hands. When the time comes, he cannot do it and begs Krieg to leave the restaurant alone. Outraged at Gin's disobedience, Krieg uses poison gas against his right-hand man."
  },
  {
    "number": 8,
    "title": "I Won't Die",
    "chapters": [63, 64, 65, 66, 67, 68, 69, 70, 71],
    "synopsis": "While the cooks (ordered by Sanji) tend to the poisoned Gin, Luffy charges at Krieg. Although the commodore uses his many weapons to severely injure him, Luffy wins; with his debt repaid, he is free to go. However, Sanji still refuses to join Luffy's crew. Only after an attempt by the cooks to convince him he is unwanted does he finally agree. Nami is welcomed back to Arlong Park, the base of Arlong's pirates (a crew consisting, aside from Nami, only of fish-men – beings who are half fish and half human. Zoro and Usopp learn separately that Nami is one of Arlong's officers – Usopp from Nami's adoptive sister Nojiko, and Zoro from Nami when he is captured and dragged into Arlong Park."
  },
  {
    "number": 9,
    "title": "Tears",
    "chapters": [72, 73, 74, 75, 76, 77, 78, 79, 80, 81],
    "synopsis": "To save the life of the villager Genzo, Usopp angers Arlong by shooting at him. Zoro (freed by Nami and told to run away while he still can) defeats Arlong's low-ranking crews at Arlong Park and meets gullible octopus fish-man Hatchan, who brings him to Nami's hometown. Usopp is captured and brought to Arlong Park, where Nami is accused of hiring Zoro to kill Arlong. To increase the crew's mistrust and save Usopp's life, she apparently kills him and kicks his body into the sea. Luffy and Sanji arrive; although they want to help, Nami turns them away. In a flashback, Arlong's crew arrives and extorts protection money from the island's inhabitants. Nami and Nojiko's foster mother, Bellemere, who cannot pay for all three of them, gives up her life to save her daughters. Nami joins Arlong's crew as their cartographer, and they agree on a price for which she can buy her village back. In the present Arlong breaks the agreement, and Nami accepts Luffy's help."
  },
  {
    "number": 10,
    "title": "OK, Let's Stand Up!",
    "chapters": [81, 82, 83, 84, 85, 86, 87, 88, 89, 90],
    "synopsis": "The Straw Hats charge into Arlong Park. Luffy takes out the fish-men's pet sea monster and most of the crew, but his feet become stuck in the ground. Arlong uses the opportunity to dig out the ground containing Luffy's feet and throw it into the sea. Zoro, struggling with a severe injury received from Mihawk and armed with only one sword, fights the six-sword-wielding Hatchan and Sanji uses karate on the fish-men with swordfish-man Kuroobi. Genzo and Nojiko try to save Luffy from drowning, and further inland Usopp duels with the long-mouthed fish-man Choo. All of Arlong's crew are defeated except for Arlong himself. With Zoro's last bit of strength, he buys Sanji enough time to dive under and remove the rock from his captain's feet. When he is free, Luffy takes Zoro's place and his final fight with Arlong begins."
  }
]
